{
'NamePat':"Гутнова А.К",
'Date':"№ 12 от «26» июня 2020 г.",
'Koi':"В.А.Койбаев",
'DisciplineTarget':"Дисциплина «Web-программирование» призвана содействовать знакомству студентов с компьютерными телекоммуникациями и возможными подходами к разработке гипертекстовых документов, предназначенных для публикации в глобальной компьютерной сети Internet. Она важна с той точки зрения, что позволяет развивать способности студентов, связанные с общей культурой работы в глобальной сети. Курс позволяет овладеть технологиями проектирования структуры web-сайта как информационной системы, создания web-сайта средствами программирования на стороне клиента и сервера, а также размещения, поддержки и сопровождения web-сайта на сервере.",
'OPOP':"школьного курса «Информатика», а также в результате освоения дисциплин: «Компьютерные науки (Языки программирования)», «Компьютерные науки (Информатика)».О понимании проблематики, целей и задач программирования, знании современных технологий программирования (структурное, модульное программирование), а также знании методов отладки и тестирования программ.",
'Know':"-основы функционирования World Wide Web;-язык гипертекстовой разметки HTML;-технологию разделения содержимого и оформления с использованием каскадных таблиц стилей CSS;-основные технологии создания Web-сайтов;-протоколы обмена информацией Web-серверов и клиентских браузеров;-основы конфигурирования web-сервера Apache для работы с РНР, SSI;-способы эффективной реализации Web-интерфейсов к базам данных;-подходы к технологиям программирования и web-технологиям;-современные тенденции развития телекоммуникационных технологий;-основы математического и алгоритмического моделирования;-подходы к переносу полученных знаний по программированию на другие задачи и другие средства разработки;-как конструкции языков веб-программирования отражают разнообразные виды действий и объектов, встречающиеся при решении практических задач по работе с данными в сети Интернет;",
'BeAbleTo':"-разворачивать рабочую среду web-разработки: выполнять разработку (написание и отладка кода) скриптов на языке РНР;-применять с использованием справочных материалов библиотечные функции РНР; -реализовывать простейшую функциональность клиентской стороны с помощью языка JavaScript; -самостоятельно создавать web-приложения уровня интернет-сайта с использованием языка РНР;-программировать алгоритмы решения задач из области программирования для Интернета;-отлаживать программы для работы в сети Интернет;-пользоваться справочными материалами в отношении РНР, HTML, JavaScript, CSS;-создавать и публиковать в Интернете собственные сайты;-реализовать основные алгоритмические конструкции посредством языка РНР; -переносить созданное web-приложение на реальный web-сервер; -инсталлировать и администрировать серверное и клиентское программное обеспечение для создания web-интерфейсов к базам данных;",
'Own':"-навыками работы в различных программных средах;-общей методикой проектирования web-сайта;-навыками организации коллективной работы над телекоммуникационными проектами;-методами и средствами создания сайтов;-методами системного анализа и математического моделирования для анализа социально-экономических задач и процессов;",
'ControlTasks':"1.Разработать дизайн сайта интернет-магазина и написать для него код на HTML с использованием CSS;2.Интерактивное меню навигации CSS;3.Написать регулярные выражения на JavaScript для проверки email;4.Создайте и заполните ассоциированный массив, в котором именами элементов будет название страны, население и название столицы (английские названия придумайте самостоятельно). Выведите из массива таблицу в три строки по две ячейки в каждой. В левой ячейке - имя элемента, в правой - его значение.5.Подсчитать количество хитов/хостов;6.Требуется написать гостевую книгу на текстовой базе;7.Разработать MySQL БД интернет-магазина, и переписать скрипт регистрации.;8.Поисковая система. Система голосования;9.Постраничный вывод данных на PHP и MySQL;10.Создание плагина Excerpt для CMS WordPress с настройкой параметров в административном интерфейсе.",
'TestTasks':"Примеры тестовых заданий по дисциплине:1. Укажите тег позволяющий определить поле для ввода пароля. +<input type='password' /><pass><hide><password>2. Как определить в классе метод myMethod?определить функцию function myMethod() и вставить ее в класс с помощью слова new+определить в классе функцию function myMethod()определить в классе функцию method myMethod()в классе не может быть методов3. Текстовые строки в PHP заключаются вквадратные скобки+кавычкикруглые скобки и кавычкикруглые скобки4. Для чтения из файла используется функцияfwrite(указатель файла, данные)+file(имя файла)fopen(имя файла, режим)",
'QuestionForTest':"1.Глобальные компьютерные сети: основные понятия, принципы функционирования. 2.Каталоги ресурсов. Поисковые системы. 3.Язык гипертекстовой разметки страниц HTML 4.Общие подходы к дизайну сайта. Разработка макета страницы 5.Использование стиля при оформлении сайта. Возможности CSS6.Хостинг. Бесплатный хостинг. FTP. Размещение Интернет-ресурса на сервере провайдера8.Преимущества и ограничения программ, работающих на стороне клиента9.Язык JavaScript10.Библиотека jQuery. Обращение к элементам.11.Основы клиент-серверных технологий.12.Введение в программирование на стороне сервера на примере PHP. Принцип работы13.HTML-формы и отправка данных с ее помощью. 14.Краткая характеристика методов Post и Get. Механизм получения данных из HTML-форм, и их обработка с помощью PHP.15.Cookie. Клиентские сценарии и приложения. Программы, выполняsющиеся на клиент-машине. Программы, выполняющиеся на сервере.16.Программирование взаимодействия PHP и MySQL. Структурированный язык запросов SQL. Команды языка SQL.17.Системы управление контентом (CMS). Назначение, функции.18.Классификация CMS.19.Настройка WordPress. Плагины, шаблоны.",
'InformationSupportOfDiscipline':" 1.Балашов Л.Е.Философия:учебник.–4-е изд.,испр.идоп.–М.:ДашковиК°,2017.–612 с. – Режим доступа: по подписке. – URL:2.Канке В.А. Основы философии: учебник / В.А. Канке. – М.: Логос, 2012. – 288 с. – Режим доступа: по подписке. – URL:ресурсы в СВОБОДНОМ ДОСТУПЕ",
'LogisticsOfTheDiscipline':" 4.1C:Предприятие.Бухгалтерский Учет. Типовая конфигурация 8 сетевая версия (№ СД/108 от 29.08.2017 (максимум-софт) бессрочно);.5.	CiscoWebex- Система проведения вебинаров (ООО Айстекдоговор № Д83-2020 от 10.08.2020-10.08.2021 г.).6.	Система управления базами данных MySQL FireBird;7.	VisualStudioCode; 8.	Blend for Visual Studio;9.	Visual Studio 2019;10.	Open Server;11.	Code Blocks;12.	Anaconda3; 13.	Android Studio;14.	PyCharm-community;15.	Python 3.8.5;16.Sublime text 3;17.	Cisco Packet Tracer",
'UpdateSheet':"№ 12 от «26» июня 2020 г."
}